[
	{ 
	"title": "High Voltage Motor Controller",
	"blurb": "For our Senior Design Project, my team has been tasked with developing a High Voltage Motor Controller for lightweight automotive use. The project aims to develop a viable replacement for the existing solutions that are expensive and closed systems that are difficult to debug and repair. These motor controller combinations are used for competition collegiate Solar Cars in the low KW power range. As of writing, we are currently working on developing the first hardware and software prototypes.</p><p>For this project I am a hardware engineer and the team's topic expert, being the most knowledgeable on the systems and applications this project is intended to meet. While I had experience working with brushless motors and controllers before this project, I have learned a lot about the theory behind brushless motor control and how to design and build electrical hardware that is capable of transmitting and controlling an incredibly useful, but dangerous, amount of power. More information about our project proposal can be viewed <a href=\"docs/sdmay25_26_proposal.pdf\">here</a>",
	"thumbnail": "seniordesign/M2096-3.jpg"
	},
	
	{ 
	"title": "Animated  Christmas Lightshow",
	"blurb": "The project of mine that has long been my \"Magnum Opus\" of sorts would be my Animated Christmas Lightshow. I started this project back in middle school, where with some accumulated holiday money and the unquestioning support of my parents (my debit card didn't have a high enough limit), I was able to purchase the starter kit for a lightshow. This lightshow was nothing fancy, some mini christmas trees made from inverted tomato cages and a PVC pole wrapped in lights, but it was enough. The first show began Christmas of 2016, and I haven't stopped since.</p><p>Today, the lightshow consists of software running on a headless machine that reads hand-built sequences and transmits that information to the master controller. This master controller sits outside in a weather-resistant enclosure and contains the hardware to drive the intelligent RGB LEDs making up much of the show. The props themselves are constructed in various manners, but most consist of coroplast (strong plastic cardboard) with the intelligent LEDs pushed through patterned holes. The show comprises over 2000 LEDs and is about 50ft wide with the tallest element being ~10ft tall.</p><p>This project is one I never could have done without the immense amount of learning and support I have experienced. I learned how to accomplish this from now-silent forum pages, many YouTube videos and extended hours reading manuals and installation guides.",
	"thumbnail": "lightshow/2023_show.jpg"
	},
	
	{ 
	"title": "Breadboard Computer",
	"blurb": "One of the first projects I completed here at Iowa State was redesigning and rebuilding a breadboard computer project I started in high school. This was a solo project I started as a way to learn about how computers function and the types of challenges encountered when designing the CPU. This was a relatively simple multicycle CPU capable of running my custom designed assembly language. For this project I built the infrastructure necessary to generate the CPU microcode from human-readable configuration files and an assembler capable of dynamic jump linking making programming much easier for an end user.</p><p>This was a project that I began before I entered any computer architecture classes, and as such I needed to learn everything I could about computer architecture and how CPUs, assemblers, and the required subcomponents function. I learned nearly everything required for this project from the 8-bit computer series by Ben Eater and the book he used, Digital Computer Electronics by Albert Paul Malvino.",
	"thumbnail": "breadboardcomputer/blurry.jpg"
	},
	
	{ 
	"title": "Solar Car Battery Monitor",
	"blurb": "I am one of the senior members of the Iowa State Solar Car Team, PRISUM. Every solar car contains a battery pack to store energy for later use, such as when the clouds come out or going up a steep hill. One of the biggest concerns with the battery packs in use is safety. The most common battery chemistry used for these batteries is Lithium-Ion (li-ion). While these batteries are very energy dense and lightweight, they are also volatile, and when damaged release their stored energy in a violent burst. The purpose of this project was to design and build the voltage and temperature monitoring portion of the battery protection system for the new battery pack.</p><p>For this project I was the lead designer and manager. The first stage of this project was the general concept and system design. The battery pack is physically organized as five rows of seven modules, each module consisting of one cell in series and 40 in parallel. The basic solution I devised was a circuit board for each row of modules that monitored the voltages and temperatures of the cells in that row.  Those boards were connected together through a ribbon cable carrying power and communications between each board and the rest of the vehicle.</p><p>The schematics I designed for this PCB are seen below. I had to do many hours of research and planning to create the finalized solution, learning a lot about how battery management systems are designed and built. Many mistakes and misteps were made along the way but the final product is shown below. All seven cells are connected to a battery voltage monitor specifically designed for this task. This monitor also performs the task of controlling passive balancing, where energy from a single cell may be discharged to keep all cells together despite real-world irregularities. Temperatures are measured through a seperate interface connected to the bottom of the board for each module.</p><p> In the process of completing this project I needed lot of external resources including the application notes for the Battery Monitor IC and the detailed feedback from Solar Car leadership and alumni reviews. I'm quite happy with the final result even though there are many items that I would change with what I've learned since doing this project.",
	"thumbnail": "swordboard/swordboard_schematic_5.png"
	}

]